docs/book-notes/EOPL/CPI/CPI.org
#+html_head: <link rel="stylesheet" href="../../../css/org-page.css"/>
#+property: tangle CPI.jo
#+title: CPI

* exp

  #+begin_src jojo
  (note program = exp)
  (note exp
    = <const-exp>
    | <zero?-exp>
    | <if-exp>
    | <diff-exp>
    | <var-exp>
    | <let-exp>
    | <proc-exp>
    | <call-exp>
    | <letrec-exp>)

  (+data <const-exp> .num)
  (+data <zero?-exp> .exp1)
  (+data <if-exp>    .exp1 .exp2 .exp3)
  (+data <diff-exp>  .exp1 .exp2)
  (+data <var-exp>   .var)
  (+data <let-exp>   .var .exp1 .body)

  (+data <proc-exp>  .var .body)
  (+data <call-exp>  .rator .rand)

  (+data <letrec-exp>
    .proc-name .bound-var .proc-body .letrec-body)
  #+end_src

* expval

  #+begin_src jojo
  (note expval
    = <num-val>
    | <bool-val>
    | <proc-val>)

  (+data <num-val>  .num)
  (+data <bool-val> .bool)

  (+data <proc-val> .proc)
  #+end_src

* proc

  #+begin_src jojo
  (+data <proc> .var .body .saved-env)

  (+jojo proc-apply (-> :val :proc :cont -- expval)
    :proc .body
    :proc .saved-env :proc .var :val cons-env
    :cont eval)
  #+end_src

* env

  #+begin_src jojo
  (note env = <null-env> | <cons-env>)

  (+data <null-env>)
  (+data <cons-env> .rest .var .val)
  (+data <cons-rec-env> .rest .proc-name .bound-var .proc-body)

  (+jojo env-apply (-> :var :env -- expval)
    (case :env
      <null-env> ["- env-apply fail" p nl
                  "  can not find var : " p :var p nl
                  error]
      <cons-env> (if [:var :env .var equal?]
                   [:env .val]
                   [:var :env .rest env-apply])
      <cons-rec-env> (cond [:var :env .proc-name equal?]
                           [:env .bound-var
                            :env .proc-body
                            :env proc proc-val]
                           else [:var :env .rest env-apply])))
  #+end_src

* program

  #+begin_src jojo
  (+jojo init-env
    null-env
    ':x 10 num-val cons-env
    ':v 5  num-val cons-env
    ':i 1  num-val cons-env)

  (+jojo program-eval (-> :program -- expval)
    :program init-env end-cont eval)
  #+end_src

