docs/book-notes/EOPL/CPI/CPI.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-15 Sun 21:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CPI</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../../../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CPI</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org39ba90a">exp</a></li>
<li><a href="#org8e9ea26">expval</a></li>
<li><a href="#org1bc8f62">proc</a></li>
<li><a href="#org9e5389a">env</a></li>
<li><a href="#org7592a65">program</a></li>
<li><a href="#orge8c699e">eval</a></li>
<li><a href="#org628f705">cont &#x2013; continuation</a>
<ul>
<li><a href="#org3ca017a">cont</a></li>
<li><a href="#org2bd430f">cont-apply</a></li>
</ul>
</li>
<li><a href="#orgb7a06f7">parse</a></li>
<li><a href="#org7b110a3">interface</a></li>
<li><a href="#org5a8138a"><span class="done _test_">[test]</span> </a></li>
</ul>
</div>
</div>

<div id="outline-container-org39ba90a" class="outline-2">
<h2 id="org39ba90a">exp</h2>
<div class="outline-text-2" id="text-org39ba90a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> program = exp<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;letrec-exp&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> .exp1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #ae81ff;">.exp1</span> <span style="color: #ae81ff;">.exp2</span> .exp3<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #ae81ff;">.exp1</span> .exp2<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   .var<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #ae81ff;">.var</span> .body<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #ae81ff;">.rator</span> .rand<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;letrec-exp&gt;</span>
  <span style="color: #ae81ff;">.proc-name</span> <span style="color: #ae81ff;">.bound-var</span> <span style="color: #ae81ff;">.proc-body</span> <span style="color: #ae81ff;">.letrec-body</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e9ea26" class="outline-2">
<h2 id="org8e9ea26">expval</h2>
<div class="outline-text-2" id="text-org8e9ea26">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> expval
  = <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>  .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span> .bool<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span> <span style="color: #ae81ff;">.proc</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bc8f62" class="outline-2">
<h2 id="org1bc8f62">proc</h2>
<div class="outline-text-2" id="text-org1bc8f62">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc&gt;</span> <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.body</span> .saved-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> proc-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:val</span> <span style="color: #a6e22e;">:proc</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.body</span>
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.saved-env</span> <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:val</span> cons-env
  <span style="color: #a6e22e;">:cont</span> eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e5389a" class="outline-2">
<h2 id="org9e5389a">env</h2>
<div class="outline-text-2" id="text-org9e5389a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> env = <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.var</span> .val<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-rec-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.proc-name</span> <span style="color: #ae81ff;">.bound-var</span> .proc-body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> env-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:env</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;null-env&gt;</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- env-apply fail"</span> p nl
                <span style="color: #e6db74;">"  can not find var : "</span> p <span style="color: #a6e22e;">:var</span> p nl
                <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-env&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.var</span> equal?<span style="color: #797979;">]</span>
                 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.val</span><span style="color: #797979;">]</span>
                 <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.rest</span> env-apply<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-rec-env&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.proc-name</span> equal?<span style="color: #797979;">]</span>
                         <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.bound-var</span>
                          <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.proc-body</span>
                          <span style="color: #a6e22e;">:env</span> proc proc-val<span style="color: #797979;">]</span>
                         <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:env</span> <span style="color: #ae81ff;">.rest</span> env-apply<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7592a65" class="outline-2">
<h2 id="org7592a65">program</h2>
<div class="outline-text-2" id="text-org7592a65">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-env
  null-env
  '<span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">10</span> num-val cons-env
  '<span style="color: #a6e22e;">:v</span> <span style="color: #ae81ff;">5</span>  num-val cons-env
  '<span style="color: #a6e22e;">:i</span> <span style="color: #ae81ff;">1</span>  num-val cons-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> program-eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:program</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:program</span> init-env end-cont eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
