docs/book-notes/EOPL/CPI/CPI.org
* eval

  #+begin_src jojo
  (+jojo eval (-> :exp :env :cont -- expval)
    (case :exp
      <const-exp> [:exp .num num-val
                   :cont cont-apply]
      <var-exp>   [:exp .var :env env-apply
                   :cont cont-apply]
      <proc-exp>  [:exp .var :exp .body :env proc proc-val
                   :cont cont-apply]

      <letrec-exp> [:env
                    :exp .proc-name
                    :exp .bound-var
                    :exp .proc-body
                    cons-rec-env :new-env!
                    :exp .letrec-body :new-env
                    :cont eval]

      <zero?-exp> [:exp .exp1 :env
                   :cont zero1-cont
                   eval]

      <let-exp>   [:exp .exp1 :env
                   :exp .var, :exp .body, :env, :cont, let-exp-cont
                   eval]

      <if-exp>    [:exp .exp1 :env
                   :exp .exp2, :exp .exp3, :env, :cont, if-test-cont
                   eval]

      <diff-exp>  [:exp .exp1 :env
                   :exp .exp2, :env, :cont, diff1-cont
                   eval]

      <call-exp>  [:exp .rator :env
                   :exp .rand, :env, :cont, rator-cont
                   eval]))
  #+end_src

* cont -- continuation

*** cont

    #+begin_src jojo
    (+data <end-cont>)
    (+data <zero1-cont> .rest)

    (+data <let-exp-cont> .var .body .env .rest)
    (+data <if-test-cont> .exp2 .exp3 .env .rest)

    (+data <diff1-cont> .exp2 .env .rest)
    (+data <diff2-cont> .val .rest)

    (+data <rator-cont> .rand .env .rest)
    (+data <rand-cont> .val .rest)
    #+end_src

