docs/book-notes/EOPL/CPI/CPI.html

<div id="outline-container-orge8c699e" class="outline-2">
<h2 id="orge8c699e">eval</h2>
<div class="outline-text-2" id="text-orge8c699e">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #a6e22e;">:env</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.num</span> num-val
                 <span style="color: #a6e22e;">:cont</span> cont-apply<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:env</span> env-apply
                 <span style="color: #a6e22e;">:cont</span> cont-apply<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:env</span> proc proc-val
                 <span style="color: #a6e22e;">:cont</span> cont-apply<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;letrec-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span>
                  <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.proc-name</span>
                  <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.bound-var</span>
                  <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.proc-body</span>
                  cons-rec-env <span style="color: #fd971f;">:new-env!</span>
                  <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.letrec-body</span> <span style="color: #a6e22e;">:new-env</span>
                  <span style="color: #a6e22e;">:cont</span> eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:cont</span> zero1-cont
                 eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span><span style="color: #f92672; font-weight: bold;">,</span> let-exp-cont
                 eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp3</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span><span style="color: #f92672; font-weight: bold;">,</span> if-test-cont
                 eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span><span style="color: #f92672; font-weight: bold;">,</span> diff1-cont
                 eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rator</span> <span style="color: #a6e22e;">:env</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rand</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span><span style="color: #f92672; font-weight: bold;">,</span> rator-cont
                 eval<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org628f705" class="outline-2">
<h2 id="org628f705">cont &#x2013; continuation</h2>
<div class="outline-text-2" id="text-org628f705">
</div><div id="outline-container-org3ca017a" class="outline-3">
<h3 id="org3ca017a">cont</h3>
<div class="outline-text-3" id="text-org3ca017a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;end-cont&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero1-cont&gt;</span> .rest<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp-cont&gt;</span> <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.body</span> <span style="color: #ae81ff;">.env</span> .rest<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-test-cont&gt;</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #ae81ff;">.env</span> .rest<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff1-cont&gt;</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #ae81ff;">.env</span> .rest<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff2-cont&gt;</span> <span style="color: #ae81ff;">.val</span> .rest<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;rator-cont&gt;</span> <span style="color: #ae81ff;">.rand</span> <span style="color: #ae81ff;">.env</span> .rest<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;rand-cont&gt;</span> <span style="color: #ae81ff;">.val</span> <span style="color: #ae81ff;">.rest</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
