docs/book-notes/EOPL/CPI/CPI.org
*** cont-apply

    #+begin_src jojo
    (+jojo cont-apply (-> :val :cont -- expval)
      (case :cont

        <end-cont>
        ["end of computation." p nl :val]

        <zero1-cont>
        [:val .num 0 eq? bool-val :cont .rest cont-apply]

        <let-exp-cont>
        [:cont .body
         :cont .env, :cont .var, :val, cons-env
         :cont .rest eval]

        <if-test-cont>
        (if [:val .bool]
          [:cont .exp2 :cont .env :cont .rest eval]
          [:cont .exp3 :cont .env :cont .rest eval])

        <diff1-cont>
        [:cont .exp2 :cont .env
         :val, :cont .rest, diff2-cont
         eval]

        <diff2-cont>
        [:cont .val .num, :val .num, sub, num-val
         :cont .rest
         cont-apply]

        <rator-cont>
        [:cont .rand :cont .env
         :val, :cont .rest, rand-cont
         eval]

        <rand-cont>
        [:val
         :cont .val .proc
         :cont .rest proc-apply]))
    #+end_src

