docs/book-notes/EOPL/CPI/CPI.html

<div id="outline-container-org2bd430f" class="outline-3">
<h3 id="org2bd430f">cont-apply</h3>
<div class="outline-text-3" id="text-org2bd430f">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> cont-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:val</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:cont</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;end-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #e6db74;">"end of computation."</span> p nl <span style="color: #a6e22e;">:val</span><span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;zero1-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:val</span> <span style="color: #ae81ff;">.num</span> <span style="color: #ae81ff;">0</span> eq? bool-val <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span> cont-apply<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.body</span>
     <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.var</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:val</span><span style="color: #f92672; font-weight: bold;">,</span> cons-env
     <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span> eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;if-test-cont&gt;</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:val</span> <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
      <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.env</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span> eval<span style="color: #797979;">]</span>
      <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.env</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;diff1-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.env</span>
     <span style="color: #a6e22e;">:val</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span><span style="color: #f92672; font-weight: bold;">,</span> diff2-cont
     eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;diff2-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.val</span> <span style="color: #ae81ff;">.num</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:val</span> <span style="color: #ae81ff;">.num</span><span style="color: #f92672; font-weight: bold;">,</span> sub<span style="color: #f92672; font-weight: bold;">,</span> num-val
     <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span>
     cont-apply<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;rator-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rand</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.env</span>
     <span style="color: #a6e22e;">:val</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span><span style="color: #f92672; font-weight: bold;">,</span> rand-cont
     eval<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;rand-cont&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:val</span>
     <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.val</span> <span style="color: #ae81ff;">.proc</span>
     <span style="color: #a6e22e;">:cont</span> <span style="color: #ae81ff;">.rest</span> proc-apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>
