docs/book-notes/EOPL/CPI/CPI.html

<div id="outline-container-orgb7a06f7" class="outline-2">
<h2 id="orgb7a06f7">parse</h2>
<div class="outline-text-2" id="text-orgb7a06f7">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #ae81ff;">123</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>
  <span style="color: #696969;">(</span>zero? <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span>
  <span style="color: #a6e22e;">:var</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>

  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">proc</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">call</span> <span style="color: #a6e22e;">:rator</span> <span style="color: #a6e22e;">:rand</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>

  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">letrec</span> <span style="color: #a6e22e;">:proc-name</span> <span style="color: #a6e22e;">:bound-var</span>
    <span style="color: #a6e22e;">:proc-body</span>
    <span style="color: #a6e22e;">:letrec-body</span><span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;letrec-exp&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> string?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/string<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> cons?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/cons<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span>  <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse fail"</span> p nl
           <span style="color: #e6db74;">"  can not parse sexp : "</span> p
           <span style="color: #a6e22e;">:sexp</span> sexp-print nl
           <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/string <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:string</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> int-string?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> string-&gt;int const-exp<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> local-string?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> var-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse/string fail"</span> p nl
          <span style="color: #e6db74;">"  can not parse string : "</span> p <span style="color: #a6e22e;">:string</span> p nl
          <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.car</span> <span style="color: #fd971f;">:key!</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #fd971f;">:body!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'zero? eq?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread zero?-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'if eq?<span style="color: #797979;">]</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread if-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'diff eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread diff-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'let eq?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span>
                           <span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.cdr</span> parse/spread let-exp<span style="color: #797979;">]</span>

        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'proc eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span>
                           <span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.cdr</span> parse/spread proc-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'call eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread call-exp<span style="color: #797979;">]</span>

        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'letrec eq?<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span>
         <span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #ae81ff;">.car</span>
         <span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #ae81ff;">.cdr</span> parse/spread letrec-exp<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/spread <span style="color: #B380A8;">{</span>parse<span style="color: #B380A8;">}</span> list-map list-spread<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b110a3" class="outline-2">
<h2 id="org7b110a3">interface</h2>
<div class="outline-text-2" id="text-org7b110a3">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> <span style="color: #66d9ef; font-weight: bold;">CPI</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:body</span> <span style="color: #66d9ef; font-weight: bold;">--</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:body</span> <span style="color: #B380A8;">{</span>parse program-eval expval-print nl<span style="color: #B380A8;">}</span> list-for-each
  '<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">begin</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> expval-print <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:expval</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:expval</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:expval</span> <span style="color: #ae81ff;">.num</span> p<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:expval</span> <span style="color: #ae81ff;">.bool</span> p<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
